var APP_DATA = {
  "scenes": [
    {
      "id": "0-1--",
      "name": "1 Лесное озеро",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        }
      ],
      "faceSize": 1024,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": -0.622611027138845,
          "pitch": -0.08813722272708979,
          "rotation": 0,
          "target": "2-3--"
        },
        {
          "yaw": -3.087458588294556,
          "pitch": -0.05121940748445297,
          "rotation": 0,
          "target": "5-6---"
        },
        {
          "yaw": 1.7408188373187086,
          "pitch": -0.08009466867495085,
          "rotation": 0,
          "target": "1-2-"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -1.8815671484098573,
          "pitch": -0.01882649633053113,
          "title": "ибис",
          "text": "остатки ибисовых найдены в отложениях среднего эоцена Германии"
        },
        {
          "yaw": 0.1806669055305612,
          "pitch": 0.06357616978096559,
          "title": "Аминодонт",
          "text": "Безрогий носорог. Был распространен в Евразии во время эоцена."
        }
      ]
    },
    {
      "id": "1-2-",
      "name": "2 Ручей",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        }
      ],
      "faceSize": 1024,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 1.078781210943296,
          "pitch": -0.09017736326702419,
          "rotation": 0,
          "target": "5-6---"
        },
        {
          "yaw": 2.959903211862854,
          "pitch": 0.0014324246896642023,
          "rotation": 0,
          "target": "0-1--"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -1.9221564381852012,
          "pitch": -0.010319431297126869,
          "title": "Аминодонт",
          "text": "Травоядный безрогий носорог эоценового периода"
        },
        {
          "yaw": 0.09981013115437598,
          "pitch": 0.1836391466124443,
          "title": "смола",
          "text": "скопления смолы хвойных переотложенные из почвы в аллювиальные отложения"
        }
      ]
    },
    {
      "id": "2-3--",
      "name": "3 Заболоченый луг",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        }
      ],
      "faceSize": 1024,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": -2.5376390780078744,
          "pitch": -0.07252514001524446,
          "rotation": 0,
          "target": "5-6---"
        },
        {
          "yaw": 2.0086598443105466,
          "pitch": -0.08895993014596826,
          "rotation": 0,
          "target": "3-4--"
        },
        {
          "yaw": -0.9890031813777682,
          "pitch": -0.16592077469514166,
          "rotation": 0,
          "target": "2-3--"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -2.972398863992767,
          "pitch": -0.03552283708528137,
          "title": "Аминодонты",
          "text": "Пара болотных носорогов кормится на заболоченном лугу"
        },
        {
          "yaw": -1.218427488811562,
          "pitch": -0.1664346323276007,
          "title": "Магнолия",
          "text": "В эоцене магнолии были обычными европейскими растениями"
        },
        {
          "yaw": -0.4922835634330536,
          "pitch": -0.25538968806590745,
          "title": "Янтарная сосна",
          "text": "Сосны которые выделяли смолу, ставшую через миллионы лет балтийским янтарем можно называть янтарными. Также переводится латинское название этого растения - Pinus succinifera."
        }
      ]
    },
    {
      "id": "3-4--",
      "name": "4 Край болота",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        }
      ],
      "faceSize": 1024,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": -1.0601894315667302,
          "pitch": -0.04672601755077821,
          "rotation": 0,
          "target": "7-8-"
        },
        {
          "yaw": 0.472092904892202,
          "pitch": -0.05213154023908828,
          "rotation": 0,
          "target": "4-5-"
        },
        {
          "yaw": 1.1834668771596704,
          "pitch": -0.019500553223849693,
          "rotation": 0,
          "target": "5-6---"
        },
        {
          "yaw": 2.5622753017147355,
          "pitch": -0.042308532833637,
          "rotation": 0,
          "target": "2-3--"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 2.3019837808636545,
          "pitch": 0.0773733527363909,
          "title": "Лептиктидиумы",
          "text": "Вымершие эоценовые млекопитающие, которые жили в Европе, питались насекомыми, а внешне были похожи на тушканчиков."
        },
        {
          "yaw": -1.185799259521131,
          "pitch": -0.5378320818913167,
          "title": "Янтарная сосна",
          "text": "Продукция смолы у янтарных сосен возможно усиливалась весной при переходе растения к активной вегетации. В это время наружу выделялся большой объем смолы, в виде капель, натеков и сосулек."
        }
      ]
    },
    {
      "id": "4-5-",
      "name": "5 Прогалина",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        }
      ],
      "faceSize": 1000,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": -3.0521662888806222,
          "pitch": -0.01850984854667459,
          "rotation": 0,
          "target": "7-8-"
        },
        {
          "yaw": 0.18104776526547717,
          "pitch": 0.04959430727861225,
          "rotation": 0,
          "target": "5-6---"
        },
        {
          "yaw": 2.0694655555353894,
          "pitch": 0.007781110895246357,
          "rotation": 0,
          "target": "3-4--"
        },
        {
          "yaw": -1.458159298564663,
          "pitch": -0.0317267868720279,
          "rotation": 0,
          "target": "6-7-"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 0.650978996458468,
          "pitch": 0.21997578650846705,
          "title": "Креодонт",
          "text": "Примитивный эоценовый хищник"
        },
        {
          "yaw": 2.839512699063625,
          "pitch": 0.1764022352658472,
          "title": "Гасторнис (Диатрима)",
          "text": "Крупная нелетающая птица, по современным представлениям растительноядная"
        },
        {
          "yaw": -2.6156526069763046,
          "pitch": 0.06941224856243267,
          "title": "Пальма сабаль",
          "text": "Вееролистные пальмы росли в эоцене в центральной Европе и в Балтийском янтаре известны находки цветов пальм"
        },
        {
          "yaw": -0.30186110073554673,
          "pitch": 1.005557619124641,
          "title": "Жук дамзениус",
          "text": "Вымерший жук листоед Damzenius anitae, один из многих сотен видов жуков, описанный из янтаря. Родовое название жука в честь господина Дамцена - коллекционера янтаря из Вильнуса."
        },
        {
          "yaw": -2.1826765615172032,
          "pitch": 0.23015323250986341,
          "title": "Капли янтарной смолы",
          "text": "Капли смолы янтарных сосен застывали на поверхности почвы, стволах и листьях растений. Так начинался долгий процесс полимеризации, окисления и деструкции неустойчивых соединений, итогом которого стало образование прекрасного ювелирного материала через 40 млн лет."
        }
      ]
    },
    {
      "id": "5-6---",
      "name": "6 Озеро с лотосами",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        }
      ],
      "faceSize": 1024,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 1.58506758420536,
          "pitch": -0.03290445266343056,
          "rotation": 0,
          "target": "2-3--"
        },
        {
          "yaw": 2.6341744105881384,
          "pitch": -0.08175368559146179,
          "rotation": 0,
          "target": "3-4--"
        },
        {
          "yaw": -2.6775042638069593,
          "pitch": -0.07627491532394437,
          "rotation": 0,
          "target": "4-5-"
        },
        {
          "yaw": -0.9272592532551265,
          "pitch": -0.06426830125189298,
          "rotation": 0,
          "target": "6-7-"
        },
        {
          "yaw": -0.16515129358781167,
          "pitch": -0.042622732403511776,
          "rotation": 0,
          "target": "1-2-"
        },
        {
          "yaw": 0.5460793387779983,
          "pitch": -0.02871422718781247,
          "rotation": 0,
          "target": "0-1--"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -2.0456319793317057,
          "pitch": 0.8137688933674454,
          "title": "Трионикс",
          "text": "Мягкотелая хищная черепаха. Такие черепахи живут в теплых пресноводных водоемах с конца мелового периода."
        },
        {
          "yaw": -0.21556860100020891,
          "pitch": 0.23766287729956304,
          "title": "Заросли лотосов",
          "text": "В эоцене лотосы росли в Европе так же как в наше время растут в Юго-Восточной Азии и Центральной Америке"
        }
      ]
    },
    {
      "id": "6-7-",
      "name": "7 Лес",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        }
      ],
      "faceSize": 1024,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": -2.508240183985418,
          "pitch": -0.07332829460355939,
          "rotation": 0,
          "target": "7-8-"
        },
        {
          "yaw": 1.4328718512246752,
          "pitch": 0.050231683123364235,
          "rotation": 0,
          "target": "4-5-"
        },
        {
          "yaw": -0.4451657489593366,
          "pitch": -0.013735926570420887,
          "rotation": 0,
          "target": "5-6---"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 2.0075020502767673,
          "pitch": 0.01692713492169773,
          "title": "Гасторнисы (Диатримы)",
          "text": "Вымершие нелетающие птицы размером от метра до двух метров в высоту. Массивные клювы служили им для добычи растительной пищи, хотя рань считалось, что эти птицы были хищными."
        },
        {
          "yaw": -1.7676263693738186,
          "pitch": 0.2870013644479634,
          "title": "Богомол",
          "text": "Янтарный лес был наполнен насекомыми, которые прекрасно сохранились до наших дней в кусочках янтаря. Среди них было много теплолюбивых - в том числе богомолы."
        }
      ]
    },
    {
      "id": "7-8-",
      "name": "8 Дебри",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        }
      ],
      "faceSize": 1024,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": -0.8995561229355253,
          "pitch": 0.03488796889590873,
          "rotation": 0,
          "target": "4-5-"
        },
        {
          "yaw": 1.13748220998529,
          "pitch": 0.06200351062364717,
          "rotation": 0,
          "target": "3-4--"
        },
        {
          "yaw": -1.5130544356912505,
          "pitch": -0.00910219680512725,
          "rotation": 0,
          "target": "6-7-"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 1.2773056529581766,
          "pitch": 0.741277621744544,
          "title": "Цикада",
          "text": "В янтарном лесу было множество птиц и насекомых, издававших громкие звуки. В том числе небольшие лесные цикады, которые часто попадаются в янтаре."
        },
        {
          "yaw": 0.43570034406732105,
          "pitch": 0.1834734307230388,
          "title": "Гасторнис (диатрима)",
          "text": "Огромная нелетающая птица из эоцена Европы. Предполагается что она питалась семенами и фруктами."
        },
        {
          "yaw": -3.0144338713614296,
          "pitch": 0.14551118003597274,
          "title": "Аминодонт",
          "text": "Болотные носороги аминодонты были обычными травоядными в эоценовых лесах Европы."
        }
      ]
    }
  ],
  "name": "Янтарный лес и эоценовые ландшафты",
  "settings": {
    "mouseViewMode": "drag",
    "autorotateEnabled": true,
    "fullscreenButton": false,
    "viewControlButtons": false
  }
};
